---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.DetailFailures
source: html/638c3d0a-a7c5-0729-4fa5-ceae2ab0af5a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DetailFailures

Failures about Detail.

## Syntax (C#)
```csharp
public static class DetailFailures
```